Config/InformationRegisters/FIASPriorityEvents.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>FIASPriorityEvents</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Request</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Response</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CommandType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsCommandSent</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsResponseReceived</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AnswerStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClearText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>CommandUUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>InteractionParameters</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalSystemInteractions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>WorkstationID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>KeyCoder</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/FIASPriorityEvents/Ext/ManagerModule.bsl
// -----------------------------------------------------------------------------
Procedure AddEvent(pUUID, pInteractionParameters, pKeyCoder, pWorkstationID, pRequest, pCommandType, pDate, pIsCommandSent = False) Export

	If Not ValueIsFilled(pUUID) Or NOT ValueIsFilled(pInteractionParameters) Then
		Return;
	EndIf;
	
	vRecSet = InformationRegisters.FIASPriorityEvents.CreateRecordSet();
	vRecSet.Filter.KeyCoder.Set(pKeyCoder);
	vRecSet.Write(True);
	
	vRecMng = InformationRegisters.FIASPriorityEvents.CreateRecordManager();
	vRecMng.InteractionParameters = pInteractionParameters;
	vRecMng.CommandUUID = pUUID; 
	vRecMng.KeyCoder = pKeyCoder;
	vRecMng.WorkstationID = pWorkstationID;
	vRecMng.Request = pRequest;
	vRecMng.CommandType = pCommandType;    
	vRecMng.IsCommandSent = pIsCommandSent; 
	vRecMng.Date = pDate;
	vRecMng.Write(True);	
	
EndProcedure // AddEvent        

// -----------------------------------------------------------------------------
Procedure DeleteEvent(pUUID, pInteractionParameters) Export

	If Not ValueIsFilled(pUUID) Or NOT ValueIsFilled(pInteractionParameters) Then
		Return;
	EndIf;
	
	vRecSet = InformationRegisters.FIASPriorityEvents.CreateRecordSet();
	vRecSet.Filter.CommandUUID.Use				= True;
	vRecSet.Filter.CommandUUID.Value			= pUUID;
	vRecSet.Filter.InteractionParameters.Use	= True;
	vRecSet.Filter.InteractionParameters.Value	= pInteractionParameters; 
	vRecSet.Read();
	vRecSet.Clear();
	vRecSet.Write(True);
	
EndProcedure // DeleteEvent      

// --------------------------------------------------------------------------------
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	// NOTHING SO FAR
EndProcedure // ExchangePlansRecordChanges
